tutorials/multiphaseEuler/fluidisedBed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    basicMultiphaseSystem;

phases (particles air);

referencePhase air;

particles
{
    type          purePhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               3e-4;
    }

    alphaMax        0.62;
    residualAlpha   1e-6;
}

air
{
    type          purePhaseModel;

    diameterModel none;

    residualAlpha   0;
}

blending
{
    default
    {
        type            continuous;
        phase           air;
    }
}

surfaceTension
{}

interfaceCompression
{}

drag
{
    particles_dispersedIn_air
    {
        type            GidaspowErgunWenYu;
    }
}

virtualMass
{}

heatTransfer
{
    particles_dispersedIn_air
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
